# Используем базовый образ Node.js
FROM node:14

# Устанавливаем рабочую директорию в контейнере
WORKDIR /usr/src/app

# Копируем файлы package.json и package-lock.json в текущую директорию
COPY package*.json ./

# Устанавливаем зависимости
RUN npm install

# Копируем все файлы из текущей директории в рабочую директорию в контейнере
COPY . .

# Указываем порт, который будет прослушивать приложение
EXPOSE 3000

# Команда, которая будет запущена при запуске контейнера
CMD ["node", "./server/server.js"]